Revit 2027 API
ColorOptions.GetColorOptions Method
 Returns the current Revit instance's ColorOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ColorOptions GetColorOptions()
Public Shared Function GetColorOptions As ColorOptions
public:
static ColorOptions^ GetColorOptions()
static member GetColorOptions : unit -> ColorOptions
Return Value
ColorOptions
 The ColorOptions for the current Revit instance.
See Also
Reference
ColorOptions Class
Autodesk.Revit.DB Namespace